// этот файл содержит цикл для записи всех книг в базу данных

const pgp = require('pg-promise')()
const cn = {
    host: 'localhost',
    port: 5432,
    database: 'libraryDB',
    user: 'postgres',
    password: '00000000'
};
const db = pgp(cn);
const book = [
    "Выбор. О свободе и внутренней силе человека",
    "К себе нежно. Книга о том, как ценить и беречь себя",
    "Роковой подарок",
    "Тревожные люди",
    "Месяц за Рубиконом",
    "Семь дней до Мегиддо",
    "Will. Чему может научить нас простой парень, ставший самым высокооплачиваемым актером Голливуда",
    "Теория невероятности. Как мечтать, чтобы сбывалось, как планировать, чтобы достигалось",
    "Сила подсознания, или Как изменить жизнь за 4 недели",
    "Мне все льзя. О том, как найти свое призвание и самого себя",
    "Тонкое искусство пофигизма. Парадоксальный способ жить счастливо",
    "НИ СЫ. Будь уверен в своих силах и не позволяй сомнениям мешать тебе двигаться вперед"
]
const author = [
    "Эдит Ева Эгер",
    "Ольга Примаченко",
    "Татьяна Устинова",
    "Фредрик Бакман",
    "Сергей Лукьяненко",
    "Сергей Лукьяненко",
    "Марк Мэнсон, Уилл Смит",
    "Татьяна Мужицкая",
    "Джо Диспенза",
    "Татьяна Мужицкая",
    "Марк Мэнсон",
    "Джен Синсеро"
]
const isbn = [
    "978-5-00-169950-7",
    "978-5-04-117369-2",
    "978-5-04-173584-5",
    "978-5-00131-284-0",
    "978-5-17-147006-7",
    "978-5-17-138988-8",
    "978-5-04-166413-8",
    "978-5-04-096135-1",
    "978-5-699-65045-3",
    "978-5-04-103490-0",
    "978-5-96-144898-6",
    "978-5-699-98630-9"
]
const age = [
    "18+",
    "16+",
    "16+",
    "18+",
    "16+",
    "16+",
    "16+",
    "16+",
    "12+",
    "16+",
    "16+",
    "16+"
]
const pages = [
    "410",
    "170",
    "290",
    "300",
    "360",
    "330",
    "500",
    "140",
    "370",
    "160",
    "180",
    "220"
]
const year = [
    "2017",
    "2020",
    "2022",
    "2019",
    "2021",
    "2021",
    "2021",
    "2019",
    "2013",
    "2017",
    "2019",
    "2013"
]
const photoLink = [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
]
const resourceLink = [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
]


for (let i = 0; i < 12; i++) {
    db.none('INSERT INTO books("book-name", "isbn", "author", "pages", "year", "age", "photo-link", "resourse-link") VALUES($1, $2, $3, $4, $5, $6, $7, $8)',
        [book[i], isbn[i], author[i], pages[i], year[i], age[i], i + 1, "none"])
        .then(() => {
            console.log(`записали ${book[i]}, ${isbn[i]}, ${author[i]}, ${pages[i]}, ${year[i]}, ${age[i]}`)
        })
        .catch(() => {
            console.log(`что-то не так ${book[i]}, ${isbn[i]}, ${author[i]}, ${pages[i]}, ${year[i]}`)
        });
}